000100191007             PGM
000101191007             CALL       STRJOB
000102191007             ADDLIBLE   BCI433LIB
000103191028             MONMSG     MSGID(CPF2103)
000104191028             ADDLIBLE   SENECAPAY
000105191028             MONMSG     MSGID(CPF2103)
000106191007             DSPSYSLVL  *DISPLAY
000107191007             ENDPGM
000108191007
