000100191031     A          R SHIFTWEEK                 PFILE(SENECAPAY/SHIFTWEEK)
000101191031     A          K EMPNUM
000102191031     A          S WORKSHIFT                 COMP(EQ '4')
