000100191028     A          R RECORD1
000101191028     A                                  2  4USER
000102191028     A                                  2 23'S E N E C A'
000103191028     A                                  2 37'Payroll Program Completed'
000104191028     A                                  2 66DATE EDTCDE(Y)
000105191028     A                                  3  4'Elisa Ng Li'
000106191028     A                                  5 09'Rates:'
000107191028     A                                  7 19'Day Rate:'
000108191028     A            DAYRATE        5  2   7 37EDTCDE(1)
000109191028     A                                  8 19'Afternoon Rate:'
000110191028     A            AFTNRATE       5  2   8 37EDTCDE(1)
000111191028     A                                  9 19'Night Rate:'
000112191028     A            NIGHTRATE      5  2   9 37EDTCDE(1)
000113191028     A                                 12 09'Totals:'
000114191028     A                                 13 19'Regular Pay:'
000115191028     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000116191028     A                                 14 19'Overtime Pay:'
000117191028     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000118191028     A                                 15 19'Company Payout:'
000119191028     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
000120191028
