000100191127       CTL-OPT NOMAIN DATFMT(*USA);
000101191127       /COPY LAB10ZFUN,DAYPROTOS
000102191127       //DCL-S DAYNAME CHAR(9);
000103191127       DCL-PROC DAYNUMNAME EXPORT;
000104191127         DCL-PI *N CHAR(9);
000105191127           DAYIN PACKED(1)  // ACCEPTS VALID INPUTS (1-7) ONLY
000106191127         END-PI;
000107191127         DCL-S DAYNAME CHAR(9);
000108191127
000109191127         END-PROC;
